import math
''' позволяет получить значение pi'''

def CircleArea(r):
    ''' 
    Принимает одно число (радиус круга) и возвращает его значение возведенное в квадрат и умноженное на pi т.е. площадь круга
        Параметры:
            x (int): натуральное число
        
        Возвращаемое значение:
            значение числа x возведенное в квадрат и умноженное на pi (float)

        Пример работы:
            input: 3
            output: 9*pi

    '''

    if r <= 0:
        return "error"
    return math.pi * r * r


def CirclePerimeter(r):
    ''' 
    Принимает одно число (радиус круга) и возвращает его значение умноженное на два и умноженное на pi т.е. периметр круга
        Параметры:
            x (int): натуральное число
        
        Возвращаемое значение:
            удвоенное значение числа x и умноженное на pi (float)
        
            
        Пример работы:
            input: 3
            output: 6*pi

    '''

    if r <= 0:
        return "error"

    return 2 * math.pi * r

