import math


def area(r):
    '''
    Принимает переменную r - радиус круга и возвращает значение площади круга.
    По формуле S = pi * r * r находится площадь;
    Пример вызова функции:
    Input: 9
    Output: 254.469
    '''
    return math.pi * r * r


def perimeter(r):
    '''
    принимает переменную r - радиус круга и возвращает значение периметра круга.
    По формуле S = pi * r * 2 находится длина;
    Пример вызова функции:
    Input: 9
    Output: 56.54867
    '''
    return 2 * math.pi * r

