def RectangleArea(x, y):
    '''  
    Принимает два числа(стороны прямугольника) и возвращает их произведение т.е. площадь прямоугольника 
        Параметры:
                x (int): первое натуральное число
                y (int): второе натуральное число

        Возвращаемое значение:
            произведение x и y (int)

        Пример работы:
            input: 2, 5
            output: 10
    '''

    if x <= 0 or y <= 0:
        return "error"

    return x * y


def RectanglePerimeter(x, y):
    '''  
    Принимает два числа(стороны прямугольника) и возвращает их удвоенную сумму т.е. периметр прямоугольника
        Параметры:
            x (int): первое натуральное число
            y (int): второе натуральное число

        Возвращаемое значение:
            удвоенная сумма x и y (int)

        Пример работы:
            input: 2, 5
            output: 14
    '''

    if x <= 0 or y <= 0:
        return "error"

    return (x + y) * 2
