def area(a, b):
    """
    Вычисляет площадь прямоугольника по сторонам a и b.

    Параметры:
        a (float): длина
        b (float): ширина

    Возвращает:
        float: площадь прямоугольника

    Пример:
        >>> area(3, 5)
        15
    """
    return a * b


def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника по сторонам a и b.

    Параметры:
        a (float): длина
        b (float): ширина

    Возвращает:
        float: периметр прямоугольника

    Пример:
        >>> perimeter(3, 5)
        16
    """
    return 2 * (a + b)

