def area(a, b):
"""
    Вычисляет площадь прямоугольника по заданной длине и ширине

    Параметры:
    a : Длина прямоугольника
    b : Ширина прямоугольника

    Возвращает: Площадь прямоугольника

    Пример вызова:
    >>> area(5, 3) -> 15
"""
    return a * b

def perimeter(a, b):
"""
    Вычисляет периметр прямоугольника по заданной длине и ширине

    Параметры:
    a : Длина прямоугольника
    b : Ширина прямоугольника

    Возвращает:
    float: Периметр прямоугольника.

    Пример вызова:
    perimeter(5, 3) -> 16
"""
    return 2 * (a + b)
