def area(a, b):
	'''возвращает значение площади прямоугольника.
	a (int): первая сторона прямоугольника
	b (int): вторая сторона прямоугольника
	По формуле S = a * b возвращает площадь.
	Пример вызова функции:
    Input: 9 13
    Output: 117
	'''
	return a * b
def perimeter(a, b):
	'''
	принимает переменные a, b - являющиеся различными сторонами прямоугольника и возвращает значение периметра прямоугольника.
    По формуле P = 2 * (a + b) возвращает периметр.
    Пример вызова функции:
    Input: 9 12
    Output: 42
	'''
	return 2 * (a + b)

