def area(a):
    """
    Принимает длину стороны квадрата, возвращает его площадь
    
    Параметры:
        a (float): Длина стороны квадрата
    
    Возвращаемое значение:
        area (float): Площадь данного квадрата
    """
    return a * a

def perimeter(a):
    """
    Принимает длину стороны квадрата, возвращает его периметр
    
    Параметры:
        a (float): Длина стороны квадрата
    
    Возвращаемое значение:
        perimeter (float): Периметр данного квадрата
    """
    return 4 * a