def SquareArea(x):
    '''  
    Принимает одно число(сторону квадрата) и возвращает его произведение само на себя т.е. площадь квадрата
        Параметры:
                x (int): натуральное число

        Возвращаемое значение:
            квадрат числа x (int)

        Пример работы:
            input: 7
            output: 49

    '''

    if x <= 0:
        return "error"

    return x * x

def SquarePerimeter(x):
    '''  
    Принимает одно число (сторону квадрата) и возвращает его значение умноженное на 4 т.е. периметр квадрата
        Параметры:
            x (int): натуральное число
        
        Возвращаемое значение:
            значение числа x умноженное на 4 (int)

        Пример работы:
            input: 7
            output: 28

    '''

    if x <= 0:
        return "error"

    return 4 * x

