def area(a):
    """
    Вычисляет площадь квадрата по заданной стороне.

    Параметры:
    a (float): длина стороны квадрата.

    Возвращаемое значение:
    float: площадь квадрата.

    Пример вызова:
    area(4) -> 16
    """
    return a * a

def perimeter(a):
    """
    Вычисляет периметр квадрата по заданной стороне.

    Параметры:
    a (float): длина стороны квадрата.

    Возвращаемое значение:
    float: периметр квадрата.

    Пример вызова:
    perimeter(4) -> 16
    """
    return 4 * a
