def area(a, h):
	'''
	принимает переменные a - сторона и h - высота и возвращает значение площади.
	По формуле S = a * h / 2 находится площадь
	Пример вызова функции:
    Input: 15 4
    Output: 30
	'''
	return a * h / 2
def perimeter(a, b, c):
	'''
	принимает переменные **a**, **b**, **c** - *являющиеся сторонами треугольника* и возвращает значение периметра треугольника.
	По формуле P = a + b + c находится периметр
	Пример вызова функции:
    Input: 5 6 7
    Output: 18
	'''
	return a + b + c

