def area(a, b, c):
"""
    вычисляет полупериметр треугольника по заданным сторонам

    параметры:
    a: длина первой стороны треугольника
    b: длина второй стороны треугольника
    c: длина третьей стороны треугольника

    возвращает:
    полупериметр треугольника

    пример вызова:
    area(3, 4, 5) -> 6.0
"""
    return (a + b + c) / 2

def perimeter(a, b, c):
"""
    вычисляет периметр треугольника по заданным сторонам

    параметры:
    a: длина первой стороны треугольника
    b: длина второй стороны треугольника
    c: длина третьей стороны треугольника

    возвращает:
    периметр треугольника

    пример вызова:
    perimeter(3, 4, 5) -> 12
"""
    return a + b + c
